03_texturedPlate/03_pyrTexture/01_baseCaseInit/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    overInlet
    //~ {
        //~ type            fixedFluxPressure;
    //~ }
    {
        type            zeroGradient;
    }
    outlet
    //~ {//fix pressure at geometry outlet
        //~ type            totalPressure;
        //~ p0              uniform 101325;
        //~ U               U;
        //~ phi             phi;
        //~ rho             rho;
        //~ psi             none;
        //~ gamma           1;
        //~ value           $internalField;
    //~ }
    {
        type            zeroGradient;
    }
    plate
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    atmosphere
    //~ {
        //~ type            fixedFluxPressure;
    //~ }
    //~ {
        //~ type            zeroGradient;
    //~ }
    {//fix pressure at geometry outlet
        type            totalPressure;
        p0              uniform 101325;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
