03_texturedPlate/03_pyrTexture/01_baseCaseInit/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  2.3.0                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

// GEOMETRY PARAMETERS
// (same as in Xu, Yuan, Repke, Wozny, CFD STUDY ON LIQUID FLOW BEHAVIOR ON FLAT PLATE FOCUSING ON EFFECT OF FLOW RATE)
// geometry length = 60 mm, geometry width = 50 mm, geometry height 1 mm, inlet height 0.3 mm


convertToMeters 	1; 

vertices 
(// to be specified
	//ground nodes
	 (  0.00  0.00  0.00 ) //0
	 (  0.06  0.00  0.00 ) //1
	 (  0.06  0.05  0.00 ) //2
	 (  0.00  0.05  0.00 ) //3
	//inlet top nodes
	 (  0.00  0.00  0.003 ) //0
	 (  0.06  0.00  0.003 ) //1
	 (  0.06  0.05  0.003 ) //2
	 (  0.00  0.05  0.003 ) //3
	//top level nodes
	 (  0.00  0.00  0.01 ) //0
	 (  0.06  0.00  0.01 ) //1
	 (  0.06  0.05  0.01 ) //2
	 (  0.00  0.05  0.01 ) //3
); 

edges 
( 
); 

blocks 
(// to be specified
	 hex 
	 	 ( 0 1 2 3 4 5 6 7 ) 
	 	 ( 150 120 20 ) 	 ( 1.0 1.0 1.0 ) 
	 hex 
	 	 ( 4 5 6 7 8 9 10 11 ) 
	 	 ( 150 120 40 ) 	 ( 1.0 1.0 1.0 ) 
); 

boundary 
( 
	inlet 
	{ 
	type patch; 
	faces 
 	(
		( 0 4 7 3 )
	);
	} 

	overInlet 
	{ 
	type patch; 
	faces 
 	(
	 	 ( 4 8 11 7 )
	);
	} 

	outlet 
	{ 
	type patch; 
	faces 
 	(
	 	 ( 1 5 6 2 )
	 	 ( 5 9 10 6 )
	);
	} 
	
	plate 
	{ 
	type wall; 
	faces 
 	(
	 	 ( 0 1 2 3 )
	);
	}
	
	sides
	{ 
	type wall; 
	faces 
 	(
	 	 ( 3 7 6 2 )
	 	 ( 7 11 10 6)
	 	 (0 4 5 1)
	 	 (4 8 9 5)
	);
	}
	
	atmosphere 
	{ 
	type patch; 
	faces 
 	(
	 	 ( 8 9 10 11 )
	);
	}

	

); 

mergePatchPairs 
( 
); 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

