03_texturedPlate/03_pyrTexture/01_baseCaseInit/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid gas);

liquid
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]	1e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ]	1000.0;
}

gas
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]	1.5e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ]	1;
}


sigma           sigma [ 1 0 -2 0 0 0 0 ]	0.07;


// ************************************************************************* //
